Papiea-design.org
#+Title: Papiea Design
#+SETUPFILE: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup
#+Options: H:5

#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+HTML_HEAD: <style>#content{max-width:70%;} </style>

Papiea is aimed to be a reference implementation of a formal general purpose intent engine. 

* Definitions
  - _Spec_ - a map containing the desired state of a particular entity
  - _Status_ - a map containing the current statue of a particular entity. Always a superset of Spec
  - _Metadata_ - Information of the identity of the entity. Must contain at least =uuid=, =kind= and =specVersion=
  - _Spec version_ - an integer representing the version of the current spec. Updates to spec will
    use this field to ensure that the change will be atomic
  - _Entity_ - The tuple =[Metadata, Spec, Status]=
  - _Kind_ - The "type" of the entity
  - _Diff_ - A difference between the current Status and the most recent desired Spec
  - _Providers_ - Pluggable handlers that can transform an entity from its current state to its desired state
  - _Tasks_ - a mechanism for following the progress of resolving Diffs
* Basic Interfaces
  The main concept behind the intentful approach is the ability to know what is the desired state of
  our system and what is the actual current state. Once we have this knowledge, many different kinds
  of engines could be built that would attempt to resolve to tension formed when the intended state,
  termed the =Spec=, is different from the current state of the system, termed the =Status=.

  In Papiea, we use both =Spec= and =Status= to have a complete view of the state of a given entity
  identity, marked by the =Metadata=. The following interfaces capture these most basic concepts.

** Metadata
   Metadata has a structured portion which contains fields that defines the identity of a particular
   entity. The fields that identify the entity are:
   - =uuid= - a unique id representing the identity of this entity
   - =kind= - the "type" of this entity
   - =spec_version= - the most up-to-date revision of the spec associated with this entity

   Other fields are also important:
   - =created_at= - logs when this entity was created
   - =delete_at= - annouces if and when will this entity be deleted. If this field is set the entity
     will be deleted by a [[*Cleanup process][Cleanup process]].
    
   #+Name: metadata-struct
   #+BEGIN_SRC typescript
     interface Metadata {
         // Identity fields
         uuid: uuid4;
         kind: string;
         specVersion: number;

         // Additional fields
         created_at: timestamp;
         delete_at: timestamp;
     }
   #+END_SRC
  
** Spec
   The =Spec=, which is the desired state, is simply a json object, or an unstructured map. It can
   and should get a structure when used specifically by any particular entity [[*Kind][Kind]]. However, at the
   engine level, a spec is an unstructured map that can be compared to the mirroring =Status= map to
   find any differences. The structure definintion may change by the provider which defines it, say
   by upgrading to a newer version (See TODO:).

   #+Name: spec-struct
   #+BEGIN_SRC typescript
   type Spec = any;
   #+END_SRC

** Status
   The =Status=, which is a representation of the true current state of the entity, is also simply a
   json. Its content and structure is a superset of [[*Spec][Spec]], meaning that every field in =Spec= will
   also appear in =Status=, but may contain any extra fields as desired by the provider.

   I am just learning typescript, so still not sure how to express that =Status= is an extension of
   =Spec=, but it should be explicit.

   #+Name: status-struct
   #+BEGIN_SRC typescript
   type Status = any;
   #+END_SRC

** Entity
   An Entity is simply the tuple =(Metadata, Spec, Status)=. It usually denotes a snapshot in time of a particular entity.

   #+Name: entity-struct
   #+BEGIN_SRC typescript
     interface Entity {
       metadata: Metadata;
       spec: Spec;
       status: Status
     }
   #+END_SRC

** Kind
   A Kind is the entity's metadata. It contains an entire description of what the entity is and what
   it may do. This information will be used to provideing full CRUD operation on the entity
   structure along with custom procedures and intentful handlers.

   #+Name: kind-struct
   #+BEGIN_SRC typescript
     // Intentful signature
     type sfs: string;

     type provider_callback_url: string;
     
     interface Kind {
         name: string;
         name_plural: string;

         //// Entity structure
         kind_structure: parsed_yaml;
         validator_fn: (entity:entity)=>boolean;
         semantic_validator_fn?: provider_callback_url; 

         //// Intentful behavior
         intentful_tasks: map<sfs, Intentful_Behavior>;

         // Every sfs lists the sfs's it has to execute before
         dependency_tree: map<sfs, sfs[]>;
         
         differ: Differ<Kind>;

         //// Procedural behavior
         procedures: map<string, Procedure>;
     }
   #+END_SRC
   
   A Kind metadata contains the following pieces:
   1. Identification and structure:
      1. a unique name along with its plural form, to generate idiomatic REST API. There may be a
         library function that create plural form, if so it should be used instead.

      2. The description of the data structre defined by this kind. The structure is defined using
         OpenAPI's model format (Swagger), which is parsed into a walkable tree.

      3. A Validator function is generated from this OpenAPI model specification. The purpose of the
         validator function is to ensure that the entity that was sent by the user is syntactically
         (structurally) correct.

      4. an optional semantic validator function is defined as a predicate exposed by the [[*Provider's SDK][Provider's
         SDK]]. It will be used to ensure that the content of the entity is correct.

   2. Intentful behavior
      1. A map from an intentful signature (see [[*SFS - Status Fields Signature][SFS - Status Fields Signature]]) to a structure
         representing the intentful behavior (see TODO:).

      2. Dependency tree between the different intentful behaviors.

      3. Using the two items above, a =Differ= is compiled. The Differ's task is to determine if
         there are any relevant differences between an entity's spec and status (relevant in this
         context means "a diff such that there exists at least one intentful behavior which can
         resolve it").

   3. Procedural behavior
      1. a map from the procedure name to a structure defining that procedure, its input argument
         and output result structures, execution strategy, etc. (see TODO:)
  
** Entity Reference
   Entities can point to other entities using a reference. A reference may onlu refers to the
   identity of an entity, and it is the intent engine that returns the entity's most recent spec and
   most current status.

   #+Name: entity-reference-struct
   #+BEGIN_SRC typescript
     interface entity_reference  {
         uuid: uuid4;
         kind: string;

         // This field is optional and is only used help the user identify
         // what this reference is pointing to. 
         name?: string;
     }
   #+END_SRC

** Provider description
   Papiea is extensible by the use of =Providers=.  A Provider defines entities by providing their
   structure, their procedures and intentful behaviors. Along with declaratively define the entity's
   structure, it also enables intentful behaviors by defining how differences between spec and
   status may be resolved. The Provider is pluggable at runtime, and should maintain no internal
   state, which should allow for simpler methods of scaling.

   #+Name: provider-desc-struct
   #+BEGIN_SRC typescript
     type Provider_Description struct {
         uuid: uuid4;
         version: Version;
         kinds: Kind[]
     }
   #+END_SRC

   A =Provider Description= contains:
   1. A unique identifier for that provider
   2. A version of that provider
   3. The list of Kinds supported by this provider

* Modules
** Databases
   #+BEGIN_note
   *Multitenancy*: All databases are aware of tenants. It may be implemented as a column or
   attribute of a table or document, or as a different database with a different connect uri.
   #+END_note
   
*** Status
    Status database will be a mapping from a metadata (namely, =uuid= and =kind=) to a status json document. 

    It may be implemented using a fast in-memory database, since it may require frequent rapid
    access depending on an entity's kind requirement. It is not required that this database be
    persisted to disk. Its content MUST always be re-acquirable by the providers, simply by asking
    all the providers to list up-to-date status of all objects known to them.

    Each provider for a kind will supply its entity's structure in its YAML.
    
**** Interface
    #+Name: status-db-interface
    #+BEGIN_SRC typescript
      interface Spec_DB {
          // Tries to update the spec. Succeeds only if the spec_version
          // field in metadata is currently equals to the one on record. The
          // implementation needs to CAS the spec_version to the increment
          // of itself, and return the new metadata with the new
          // spec_version and the new CASed in spec.
          update_spec(meta:metadata, spec:spec):[boolean, metadata, spec];

          // Get the spec of a particular entity from the db. Returns both
          // current metadata and the spec of that entity.
          get_spec(meta:metadata):[metadata, spec];

          // List all specs that have their fields match the ones given in
          // fields_map. E.g. we could look for all specs for `vm` kind that
          // have a certain ip:
          // list_specs({"metadata": {"kind": "vm"},
          //             "spec":     {"ip":   "10.0.0.10"}})
          //
          // We could come up with command such as greater-than etc at some
          // later point, or we could use a similar dsl to mongodb search
          // dsl.
          list_specs(fields_map: any): [metadata, spec][];
      }
    #+END_SRC

*** Spec
    Unlike status which can always be fetched from the providers, spec is a record of the user's
    intent and must be persistent. It must also be scalable and highly available. It must have a
    clear notion of atomicity (such as compare-and-set/swap) in order to atomically update spec
    values.

**** Interface
    #+Name: spec-db-interface
    #+BEGIN_SRC go
      interface Status_DB{
          // Update the status in the status db. As long as the input is
          // correct this always succeeds.
          update_status(meta:metadata, status:status):boolean;

          // Gets the status of a particular entity from the db. Returns
          // both current metadata and status of the entity.
          get_status(meta:metadata):[metadata, status];

          // List all status that have their fields match the ones given in
          // fields_map. E.g. we could look for all specs for `vm` kind that
          // have a certain ip:
          // list_specs({"metadata": {"kind": "vm"},
          //             "status":   {"ip":   "10.0.0.10"}})
          //
          // We could come up with command such as greater-than etc at some
          // later point, or we could use a similar dsl to mongodb search
          // dsl.
          list_specs(fields_map: any): [metadata, status][];
      }
    #+END_SRC

*** Providers
    Providers database stores all the configurations a provider has registered (encoded in [[*Provider description][Provider
    description]] section). It is used by the engine to record which providers are registered. The
    engine uses this indirectly to initialize all user-facing APIs. This seperation makes it easy to
    scale the engine to many instances.

**** Interface
    #+Name: providers-db-interface
    #+BEGIN_SRC typescript
      interface Providers_DB {

          // Register a new provider with the intent engine
          register_provider(provider: Provider_Description):void;

          //Upgrade a provider
          upgrade_provider(from_provider: uuid4, to: providerDescription): Task;

          // List all registered providers
          listProviders(): providerDescription[]

          // Removes and de-registers a provider from the intent engine
          deleteProvider(provider: uuid4): boolean;
      }
    #+END_SRC

** Dependent services
*** Tasks
    Papiea defines a task to be a mechanism that tracks the progress of change towards a
    *particular* spec version. It does not matter how the change took place: through a provider,
    manually or by an error. A task will listen on the relevant status changes and mark off the
    different fields as they get resolved. To get a clearer understanding of the logic underlying
    this please see [[*Intentful Tasks][Intentful Tasks]] section below.

    #+BEGIN_note
    Unlike the traditional definition of a task as a handle to a running process, Papiea does not
    start a particular thread or process to that works on a =Diff=. Instead the task simply listens
    the relevant changes in the entity and tracks its progress. 
    #+END_note
    
